app/controllers/todos_controller.rb

INSERT INTO "todos" ("created_at", "list", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-01-30 09:07:16.842280"], ["list", "ROR"], ["name", "College"], ["updated_at", "2016-01-30 09:07:16.842280"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save